app/services/lead_agent_service.rb

    def find_designer_output(lead)
      lead.agent_outputs.find_by(agent_name: "DESIGNER")
---
SELECT "agent_outputs".* FROM "agent_outputs" WHERE "agent_outputs"."lead_id" = 6 AND "agent_outputs"."agent_name" = 'SEARCH' LIMIT 1