app/services/lead_agent_service.rb

        end

        # Store output - this creates a NEW record each time
        saved_output = LeadAgentService::OutputManager.save_agent_output(lead, next_agent, result, AgentConstants::STATUS_COMPLETED)
---
UPDATE "leads" SET "stage" = 'searched', "updated_at" = '2025-10-29 18:52:44.402566' WHERE "leads"."id" = 6

          meets_min_score = result["meets_min_score"] || result[:meets_min_score] || false

          # Update lead quality
          LeadAgentService::StageManager.update_lead_quality(lead, result)
---
UPDATE "leads" SET "quality" = 'high', "updated_at" = '2025-10-29 18:53:07.542596' WHERE "leads"."id" = 6

        # Store error output with appropriate fields based on agent type
        error_output = LeadAgentService::OutputManager.create_error_output(e, next_agent, lead)

        LeadAgentService::OutputManager.save_agent_output(lead, next_agent, error_output, AgentConstants::STATUS_FAILED)
---
INSERT INTO "agent_outputs" ("lead_id", "agent_name", "output_data", "status", "error_message", "created_at", "updated_at") VALUES (7, 'CRITIQUE', '{"email_content":"","number_of_revisions":0,"critique":"<p>No content was provided for the email.<br>An empty email cannot achieve any marketing objective or engage your target reader.<br>To receive effective feedback, please include the subject line, body text, and a clear call to action.</p>"}', 'completed', NULL, '2025-10-29 19:18:38.607342', '2025-10-29 19:18:38.607342') RETURNING "id"