app/services/lead_agent_service.rb

    def load_previous_outputs(lead, current_agent)
      outputs = {}

      # WRITER needs SEARCH output
      if current_agent == 'WRITER'
        search_output = lead.agent_outputs.find_by(agent_name: 'SEARCH')
        outputs['SEARCH'] = search_output&.output_data
      end

      # CRITIQUE needs WRITER output
      if current_agent == 'CRITIQUE'
        writer_output = lead.agent_outputs.find_by(agent_name: 'WRITER')
---
SELECT "agent_outputs".* FROM "agent_outputs" WHERE "agent_outputs"."lead_id" = 1 AND "agent_outputs"."agent_name" = 'SEARCH' LIMIT 1
SELECT "agent_outputs".* FROM "agent_outputs" WHERE "agent_outputs"."lead_id" = 7 AND "agent_outputs"."agent_name" = 'SEARCH' LIMIT 1

    def get_agent_config(campaign, agent_name)
      campaign.agent_configs.find_by(agent_name: agent_name) ||
        campaign.agent_configs.create!(
          agent_name: agent_name,
          settings: default_settings_for_agent(agent_name),
          enabled: true  # Enabled by default to allow execution
        )
---
INSERT INTO "agent_configs" ("agent_name", "campaign_id", "created_at", "enabled", "settings", "updated_at") VALUES ('CRITIQUE', 1, '2025-10-30 00:38:18.720233', TRUE, '{}', '2025-10-30 00:38:18.720233') RETURNING "id"
SELECT "agent_configs".* FROM "agent_configs" WHERE "agent_configs"."campaign_id" = 1 AND "agent_configs"."agent_name" = 'SEARCH' LIMIT 1

    def save_agent_output(lead, agent_name, output_data, status)
      agent_output = lead.agent_outputs.find_or_initialize_by(agent_name: agent_name)
---
SELECT "agent_outputs".* FROM "agent_outputs" WHERE "agent_outputs"."lead_id" = 1 AND "agent_outputs"."agent_name" = 'SEARCH' LIMIT 1

    def advance_stage(lead, agent_name)
      current_index = STAGE_PROGRESSION.index(lead.stage) || -1
      next_index = current_index + 1

      # Only advance if not already at the final stage
      if next_index < STAGE_PROGRESSION.length
        new_stage = STAGE_PROGRESSION[next_index]
        lead.update!(stage: new_stage)
---
UPDATE "leads" SET "stage" = 'searched', "updated_at" = '2025-10-29 22:33:27.634804' WHERE "leads"."id" = 1

    def update_lead_quality(lead, critique_output)
      # Simple quality assessment based on critique presence
      # If critique is nil or empty, email was approved (high quality)
      # If critique exists, email needs improvement (medium quality)
      critique = critique_output.is_a?(Hash) ? critique_output['critique'] : nil
      quality = (critique.nil? || critique.empty?) ? 'high' : 'medium'

      if lead.quality != quality
        lead.update!(quality: quality)
---
UPDATE "leads" SET "quality" = 'high', "updated_at" = '2025-10-30 00:38:25.868010' WHERE "leads"."id" = 1