campaign_manager/app/controllers/api/v1/agent_configs_controller.rb

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."user_id" = 1 AND "campaigns"."id" = 1 LIMIT 1
SELECT "agent_configs".* FROM "agent_configs" WHERE "agent_configs"."campaign_id" = 1
---
      def index
        campaign = current_user.campaigns.find_by(id: params[:campaign_id])

        unless campaign
          render json: { errors: ['Campaign not found or unauthorized'] }, status: :not_found
          return
        end

        configs = campaign.agent_configs.map do |config|