campaign_manager/app/controllers/api/v1/base_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@example.com' LIMIT 1
---
      def current_user
        if skip_auth?
          # Always use admin@example.com in development mode for testing
          admin_user = User.find_by(email: 'admin@example.com') || User.create!(
            email: "admin@example.com",
            password: "password123",
            password_confirmation: "password123",
            name: "Admin User"
          )