campaign_manager/app/controllers/api/v1/leads_controller.rb

SELECT "leads".* FROM "leads" INNER JOIN "campaigns" ON "campaigns"."id" = "leads"."campaign_id" WHERE "campaigns"."user_id" = 2
---
      def index
        # Only return leads from campaigns belonging to the current user
        render json: Lead.joins(:campaign).where(campaigns: { user_id: current_user.id })

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."user_id" = 1 AND "campaigns"."id" = 1 LIMIT 1
INSERT INTO "leads" ("name", "email", "title", "company", "website", "campaign_id", "stage", "quality", "created_at", "updated_at") VALUES ('Konstantinos Anagnostopoulos', 'konstantinos.a@columbia.edu', 'Head TA', 'Columbia University', 'columbia.edu', 1, 'queued', '-', '2025-10-29 18:42:04.517090', '2025-10-29 18:42:04.517090') RETURNING "id"
---
      def create
        # Verify the campaign belongs to current user before creating lead
        campaign = current_user.campaigns.find_by(id: lead_params[:campaign_id])
        unless campaign
          render json: { errors: ['Campaign not found or unauthorized'] }, status: :unprocessable_entity
          return
        end

        lead = campaign.leads.build(lead_params.except(:campaign_id))
        if lead.save

UPDATE "leads" SET "name" = 'Alex Marting', "updated_at" = '2025-10-29 10:21:06.031413' WHERE "leads"."id" = 1
---
      def update
        # Only allow updating leads from campaigns belonging to current user
        lead = Lead.joins(:campaign).where(campaigns: { user_id: current_user.id }).find_by(id: params[:id])
        if lead && lead.update(lead_params.except(:campaign_id))

SELECT "leads".* FROM "leads" INNER JOIN "campaigns" ON "campaigns"."id" = "leads"."campaign_id" WHERE "campaigns"."user_id" = 1 AND "leads"."id" = 6 LIMIT 1
DELETE FROM "leads" WHERE "leads"."id" = 6
---
      def destroy
        # Only allow deleting leads from campaigns belonging to current user
        lead = Lead.joins(:campaign).where(campaigns: { user_id: current_user.id }).find_by(id: params[:id])
        if lead
          lead.destroy

SELECT "leads".* FROM "leads" INNER JOIN "campaigns" ON "campaigns"."id" = "leads"."campaign_id" WHERE "campaigns"."user_id" = 1 AND "leads"."id" = 2 LIMIT 1
---
      def run_agents
        # Find lead and verify ownership
        lead = Lead.joins(:campaign).where(campaigns: { user_id: current_user.id }).find_by(id: params[:id])

SELECT "leads".* FROM "leads" INNER JOIN "campaigns" ON "campaigns"."id" = "leads"."campaign_id" WHERE "campaigns"."user_id" = 1 AND "leads"."id" = 2 LIMIT 1
SELECT "agent_outputs".* FROM "agent_outputs" WHERE "agent_outputs"."lead_id" = 2
---
      def agent_outputs
        # Find lead and verify ownership
        lead = Lead.joins(:campaign).where(campaigns: { user_id: current_user.id }).find_by(id: params[:id])

        unless lead
          render json: { errors: ['Lead not found or unauthorized'] }, status: :not_found
          return
        end

        # Get all agent outputs for this lead
        outputs = lead.agent_outputs.map do |output|

SELECT "leads".* FROM "leads" INNER JOIN "campaigns" ON "campaigns"."id" = "leads"."campaign_id" WHERE "campaigns"."user_id" = 1 AND "leads"."id" = 7 LIMIT 1
SELECT "agent_outputs".* FROM "agent_outputs" WHERE "agent_outputs"."lead_id" = 7 AND "agent_outputs"."agent_name" = 'WRITER' LIMIT 1
---
      def update_agent_output
        # Find lead and verify ownership
        lead = Lead.joins(:campaign).where(campaigns: { user_id: current_user.id }).find_by(id: params[:id])

        unless lead
          render json: { errors: ['Lead not found or unauthorized'] }, status: :not_found
          return
        end

        agent_name = params[:agentName] || params[:agent_name]

        unless agent_name
          render json: { errors: ['Agent name is required'] }, status: :unprocessable_entity
          return
        end

        # Only allow updating WRITER and SEARCH
        unless agent_name.in?(%w[WRITER SEARCH])
          render json: { errors: ['Only WRITER and SEARCH agent outputs can be updated'] }, status: :unprocessable_entity
          return
        end

        # Find the agent output
        agent_output = lead.agent_outputs.find_by(agent_name: agent_name)