app/controllers/api/v1/campaigns_controller.rb

      def index
        # Only return campaigns belonging to the current user
        # Use includes to prevent N+1 queries when accessing associations
        render json: current_user.campaigns.includes(:leads, :agent_configs)
---
SELECT "leads".* FROM "leads" INNER JOIN "campaigns" ON "campaigns"."id" = "leads"."campaign_id" WHERE "campaigns"."user_id" = 1
SELECT "campaigns".* FROM "campaigns"

      def create
        # Associate campaign with current user
        campaign = current_user.campaigns.build(campaign_params)
        if campaign.save
---
INSERT INTO "campaigns" ("base_prompt", "created_at", "title", "updated_at", "user_id") VALUES ('Promote a groundbreaking valuation technique to price risk', '2025-10-30 00:39:06.021609', 'Insurtech Startup', '2025-10-30 00:39:06.021609', 1) RETURNING "id"

      def update
        # Only allow updating campaigns that belong to current user
        campaign = current_user.campaigns.find_by(id: params[:id])
        if campaign && campaign.update(campaign_params)
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."user_id" = 1 AND "campaigns"."id" = 2 LIMIT 1
UPDATE "campaigns" SET "title" = 'Insurtech Startup', "updated_at" = '2025-10-29 20:34:25.910202' WHERE "campaigns"."id" = 2